www/Openstack/openstack-havana-all-in-one-deploy.org
#+SETUPFILE: ../css/level-1.orgcss
#+TITLE: openstack havana all-in-one部署
#+DATE: 2014-01-07 10:38
#+OPTIONS: ^:{}
* 修改记录
|       时间 | 内容                             |
|------------+----------------------------------|
| 2014.01.07 | nova.conf和l3-agent firewall配置 |
* 部署环境
64位ubuntu-12.04.1-server系统 \\
双网卡
+ 外网eth0 192.168.60.108/24
+ 内网eth1 172.16.0.254/24
双硬盘
* 初始网卡配置
为eth0和eth1配置IP
#+BEGIN_SRC sh
# cat /etc/network/interfaces
auto lo
iface lo inet loopback

auto eth0
iface eth0 inet static
address 192.168.60.108
netmask 255.255.255.0
gateway 192.168.60.1
dns-nameservers 8.8.8.8

auto eth1
iface eth1 inet static
        address 172.16.0.254
        netmask 255.255.255.0
#+END_SRC
重启网络
#+BEGIN_SRC sh
/etc/init.d/networking restart
#+END_SRC
* 添加havana源
#+BEGIN_SRC sh
apt-get install python-software-properties
add-apt-repository cloud-archive:havana
apt-get update && apt-get dist-upgrade
reboot
#+END_SRC
* 安装mysql和rabbitmq
#+BEGIN_SRC sh
#设置mysql root用户密码为123456
echo mysql-server-5.5 mysql-server/root_password password 123456 | debconf-set-selections
echo mysql-server-5.5 mysql-server/root_password_again password 123456 | debconf-set-selections
apt-get install mysql-server mysql-client python-mysqldb
#允许外部访问mysql
sed -i -e  "s/^\(bind-address\s*=\).*/\1 0.0.0.0/" /etc/mysql/my.cnf
#+END_SRC
** 创建数据库
数据库名称为各组件名字，密码与数据库名相同。
#+BEGIN_SRC sh
#进入mysql
mysql -u root -p123456
CREATE DATABASE keystone;
CREATE DATABASE glance;
CREATE DATABASE nova;
CREATE DATABASE cinder;
CREATE DATABASE neutron;
CREATE DATABASE heat;

GRANT ALL PRIVILEGES ON keystone.* TO 'keystone'@'localhost' IDENTIFIED BY 'keystone';
GRANT ALL PRIVILEGES ON keystone.* TO 'keystone'@'%' IDENTIFIED BY 'keystone';

GRANT ALL PRIVILEGES ON glance.* TO 'glance'@'localhost' IDENTIFIED BY 'glance';
GRANT ALL PRIVILEGES ON glance.* TO 'glance'@'%' IDENTIFIED BY 'glance';

GRANT ALL PRIVILEGES ON nova.* TO 'nova'@'localhost' IDENTIFIED BY 'nova';
GRANT ALL PRIVILEGES ON nova.* TO 'nova'@'%' IDENTIFIED BY 'nova';

GRANT ALL PRIVILEGES ON cinder.* TO 'cinder'@'localhost' IDENTIFIED BY 'cinder';
GRANT ALL PRIVILEGES ON cinder.* TO 'cinder'@'%' IDENTIFIED BY 'cinder';

GRANT ALL PRIVILEGES ON neutron.* TO 'neutron'@'localhost' IDENTIFIED BY 'neutron';
GRANT ALL PRIVILEGES ON neutron.* TO 'neutron'@'%' IDENTIFIED BY 'neutron';

GRANT ALL PRIVILEGES ON heat.* TO 'heat'@'localhost' IDENTIFIED BY 'heat';
GRANT ALL PRIVILEGES ON heat.* TO 'heat'@'%' IDENTIFIED BY 'heat';
#+END_SRC
#重启mysql服务
#+BEGIN_SRC sh
/etc/init.d/mysql restart
#+END_SRC
** 安装rabbitmq
#+BEGIN_SRC sh
apt-get install rabbitmq-server
#+END_SRC
rabbitmq-server默认会创建一个用户，用户名密码均为guest，并允许任何人用guest用户和默认密码访问RabbitMQ server。
如果需要可以修改guest密码,命令:
#+BEGIN_SRC sh
rabbitmqctl change_password guest NEW_PASS
#+END_SRC
* 安装和配置Keystone
** 安装
#+BEGIN_SRC sh
apt-get install keystone
#+END_SRC
** 删除默认keystone的sqlite db 文件
#+BEGIN_SRC sh
rm -f /var/lib/keystone/keystone.db
#+END_SRC
** 配置openssl
在keystone与OpenStack服务之间如果要使用ssl进行token认证,就需要使用到openssl
#+BEGIN_SRC sh
openssl rand -hex 10
cdccc11cf024bd7de58e
#+END_SRC
** 修改配置文件
