public_html/Openstack/openstack-havana-all-in-one-deploy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>openstack havana all-in-one部署</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="openstack havana all-in-one部署"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-01-07 10:38"/>
<meta name="author" content="wchunx "/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

<link href="../css/org.css" rel="stylesheet" type="text/css">
<link href="../css/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="../css/bootstrap-responsive.min.css" rel="stylesheet">

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../sitemap.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">openstack havana all-in-one部署</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 修改记录</a></li>
<li><a href="#sec-2">2 部署环境</a></li>
<li><a href="#sec-3">3 初始网卡配置</a></li>
<li><a href="#sec-4">4 添加havana源</a></li>
<li><a href="#sec-5">5 安装mysql和rabbitmq</a>
<ul>
<li><a href="#sec-5-1">5.1 创建数据库</a></li>
<li><a href="#sec-5-2">5.2 安装rabbitmq</a></li>
</ul>
</li>
<li><a href="#sec-6">6 安装和配置Keystone</a>
<ul>
<li><a href="#sec-6-1">6.1 安装</a></li>
<li><a href="#sec-6-2">6.2 删除默认keystone的sqlite db 文件</a></li>
<li><a href="#sec-6-3">6.3 配置openssl</a></li>
<li><a href="#sec-6-4">6.4 修改配置文件</a>
<ul>
<li><a href="#sec-6-4-1">6.4.1 修改/etc/keystone/keystone.conf</a></li>
<li><a href="#sec-6-4-2">6.4.2 同步keystone表数据到db中并重启keystone</a></li>
</ul>
</li>
<li><a href="#sec-6-5">6.5 创建tenant、user、roles</a>
<ul>
<li><a href="#sec-6-5-1">6.5.1 首先创建两个环境变量</a></li>
<li><a href="#sec-6-5-2">6.5.2 创建admin和service两个租户</a></li>
<li><a href="#sec-6-5-3">6.5.3 创建用户admin，密码password</a></li>
<li><a href="#sec-6-5-4">6.5.4 创建角色admin</a></li>
<li><a href="#sec-6-5-5">6.5.5 关联用户、角色、租户</a></li>
</ul>
</li>
<li><a href="#sec-6-6">6.6 创建Services 及 API endpoints</a></li>
<li><a href="#sec-6-7">6.7 验证认证服务(Keystone)安装是否成功</a></li>
</ul>
</li>
<li><a href="#sec-7">7 安装和配置glance</a>
<ul>
<li><a href="#sec-7-1">7.1 安装</a></li>
<li><a href="#sec-7-2">7.2 修改glance配置文件</a></li>
<li><a href="#sec-7-3">7.3 同步数据库</a></li>
<li><a href="#sec-7-4">7.4 创建名为glance的认证用户</a></li>
<li><a href="#sec-7-5">7.5 创建service服务和endpoint</a></li>
<li><a href="#sec-7-6">7.6 重启glance服务</a></li>
<li><a href="#sec-7-7">7.7 上传镜像</a></li>
</ul>
</li>
<li><a href="#sec-8">8 安装和配置nova</a>
<ul>
<li><a href="#sec-8-1">8.1 安装计算服务</a></li>
<li><a href="#sec-8-2">8.2 修复guestfs的一个bug</a></li>
<li><a href="#sec-8-3">8.3 删除默认nova的sqlite db文件</a></li>
<li><a href="#sec-8-4">8.4 修改配置文件</a></li>
<li><a href="#sec-8-5">8.5 创建用户与角色</a></li>
<li><a href="#sec-8-6">8.6 创建service服务和endpoint</a></li>
<li><a href="#sec-8-7">8.7 重启nova服务</a></li>
</ul>
</li>
<li><a href="#sec-9">9 Block Storage (Cinder)安装</a>
<ul>
<li><a href="#sec-9-1">9.1 安装服务</a></li>
<li><a href="#sec-9-2">9.2 建立一个逻辑卷卷组 cinder-volumes</a></li>
<li><a href="#sec-9-3">9.3 修改配置文件</a></li>
<li><a href="#sec-9-4">9.4 创建用户，角色，服务和endpoint</a></li>
<li><a href="#sec-9-5">9.5 同步数据并重启服务</a></li>
<li><a href="#sec-9-6">9.6 检查</a></li>
</ul>
</li>
<li><a href="#sec-10">10 安装和配置neutron</a>
<ul>
<li><a href="#sec-10-1">10.1 创建用户，服务和endpoint</a></li>
<li><a href="#sec-10-2">10.2 安装网络服务</a>
<ul>
<li><a href="#sec-10-2-1">10.2.1 安装neutron组件</a></li>
<li><a href="#sec-10-2-2">10.2.2 打开ip_forward</a></li>
<li><a href="#sec-10-2-3">10.2.3 编辑配置文件</a></li>
</ul>
</li>
<li><a href="#sec-10-3">10.3 安装ovs插件</a>
<ul>
<li><a href="#sec-10-3-1">10.3.1 安装</a></li>
<li><a href="#sec-10-3-2">10.3.2 网络配置</a>
<ul>
<li><a href="#sec-10-3-2-1">10.3.2.1 建立网桥</a></li>
<li><a href="#sec-10-3-2-2">10.3.2.2 编辑配置/etc/network/interfaces</a></li>
<li><a href="#sec-10-3-2-3">10.3.2.3 重启网络</a></li>
</ul>
</li>
<li><a href="#sec-10-3-3">10.3.3 编辑配置文件</a></li>
</ul>
</li>
<li><a href="#sec-10-4">10.4 重启服务</a></li>
</ul>
</li>
<li><a href="#sec-11">11 Orchestration Server(Heat)安装</a>
<ul>
<li><a href="#sec-11-1">11.1 安装</a></li>
<li><a href="#sec-11-2">11.2 删除默认heat的sqlite db 文件</a></li>
<li><a href="#sec-11-3">11.3 编辑配置文件</a></li>
<li><a href="#sec-11-4">11.4 同步数据</a></li>
<li><a href="#sec-11-5">11.5 创建用户和角色</a></li>
<li><a href="#sec-11-6">11.6 创建服务和endpoint</a></li>
<li><a href="#sec-11-7">11.7 重启服务</a></li>
<li><a href="#sec-11-8">11.8 创建和管理stacks</a></li>
</ul>
</li>
<li><a href="#sec-12">12 Metering/Monitoring Server（Ceilometer）安装</a>
<ul>
<li><a href="#sec-12-1">12.1 安装</a></li>
<li><a href="#sec-12-2">12.2 创建数据库</a></li>
<li><a href="#sec-12-3">12.3 修改配置文件</a></li>
<li><a href="#sec-12-4">12.4 创建用户，角色，服务和endpoint</a></li>
<li><a href="#sec-12-5">12.5 重启服务</a></li>
</ul>
</li>
<li><a href="#sec-13">13 安装horizon</a></li>
<li><a href="#sec-14">14 参考资料</a>
<ul>
<li><a href="#sec-14-1">14.1 heat</a></li>
</ul>
</li>
<li><a href="#sec-15">15 安装及使用问题</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 修改记录</h2>
<div class="outline-text-2" id="text-1">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">时间</th><th scope="col" class="left">内容</th></tr>
</thead>
<tbody>
<tr><td class="left">2014.01.07</td><td class="left">nova.conf和l3-agent firewall配置</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 部署环境</h2>
<div class="outline-text-2" id="text-2">

<p>64位ubuntu-12.04.1-server系统 <br/>
双网卡
</p><ul>
<li>外网eth0 192.168.60.108/24
</li>
<li>内网eth1 172.16.0.254/24
</li>
</ul>

<p>双硬盘
</p></div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 初始网卡配置</h2>
<div class="outline-text-2" id="text-3">

<p>为eth0和eth1配置IP
</p>


<pre class="src src-sh"><span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">cat /etc/network/interfaces</span>
auto lo
iface lo inet loopback

auto eth0
iface eth0 inet static
address 192.168.60.108
netmask 255.255.255.0
gateway 192.168.60.1
dns-nameservers 8.8.8.8

auto eth1
iface eth1 inet static
        address 172.16.0.254
        netmask 255.255.255.0
</pre>

<p>
重启网络
</p>


<pre class="src src-sh">/etc/init.d/networking restart
</pre>

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 添加havana源</h2>
<div class="outline-text-2" id="text-4">




<pre class="src src-sh">apt-get install python-software-properties
add-apt-repository cloud-archive:havana
apt-get update &amp;&amp; apt-get dist-upgrade
reboot
</pre>

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 安装mysql和rabbitmq</h2>
<div class="outline-text-2" id="text-5">




<pre class="src src-sh"><span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">&#35774;&#32622;mysql root&#29992;&#25143;&#23494;&#30721;&#20026;123456</span>
<span style="color: #859900;">echo</span> mysql-server-5.5 mysql-server/root_password password 123456 | debconf-set-selections
<span style="color: #859900;">echo</span> mysql-server-5.5 mysql-server/root_password_again password 123456 | debconf-set-selections
apt-get install mysql-server mysql-client python-mysqldb
<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">&#20801;&#35768;&#22806;&#37096;&#35775;&#38382;mysql</span>
sed -i -e  <span style="color: #2aa198;">"s/^\(bind-address\s*=\).*/\1 0.0.0.0/"</span> /etc/mysql/my.cnf
</pre>


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 创建数据库</h3>
<div class="outline-text-3" id="text-5-1">

<p>数据库名称为各组件名字，密码与数据库名相同。
</p>


<pre class="src src-sh"><span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">&#36827;&#20837;mysql</span>
mysql -u root -p123456
CREATE DATABASE keystone;
CREATE DATABASE glance;
CREATE DATABASE nova;
CREATE DATABASE cinder;
CREATE DATABASE neutron;
CREATE DATABASE heat;

GRANT ALL PRIVILEGES ON keystone.* TO <span style="color: #2aa198;">'keystone'</span>@<span style="color: #2aa198;">'localhost'</span> IDENTIFIED BY <span style="color: #2aa198;">'keystone'</span>;
GRANT ALL PRIVILEGES ON keystone.* TO <span style="color: #2aa198;">'keystone'</span>@<span style="color: #2aa198;">'%'</span> IDENTIFIED BY <span style="color: #2aa198;">'keystone'</span>;

GRANT ALL PRIVILEGES ON glance.* TO <span style="color: #2aa198;">'glance'</span>@<span style="color: #2aa198;">'localhost'</span> IDENTIFIED BY <span style="color: #2aa198;">'glance'</span>;
GRANT ALL PRIVILEGES ON glance.* TO <span style="color: #2aa198;">'glance'</span>@<span style="color: #2aa198;">'%'</span> IDENTIFIED BY <span style="color: #2aa198;">'glance'</span>;

GRANT ALL PRIVILEGES ON nova.* TO <span style="color: #2aa198;">'nova'</span>@<span style="color: #2aa198;">'localhost'</span> IDENTIFIED BY <span style="color: #2aa198;">'nova'</span>;
GRANT ALL PRIVILEGES ON nova.* TO <span style="color: #2aa198;">'nova'</span>@<span style="color: #2aa198;">'%'</span> IDENTIFIED BY <span style="color: #2aa198;">'nova'</span>;

GRANT ALL PRIVILEGES ON cinder.* TO <span style="color: #2aa198;">'cinder'</span>@<span style="color: #2aa198;">'localhost'</span> IDENTIFIED BY <span style="color: #2aa198;">'cinder'</span>;
GRANT ALL PRIVILEGES ON cinder.* TO <span style="color: #2aa198;">'cinder'</span>@<span style="color: #2aa198;">'%'</span> IDENTIFIED BY <span style="color: #2aa198;">'cinder'</span>;

GRANT ALL PRIVILEGES ON neutron.* TO <span style="color: #2aa198;">'neutron'</span>@<span style="color: #2aa198;">'localhost'</span> IDENTIFIED BY <span style="color: #2aa198;">'neutron'</span>;
GRANT ALL PRIVILEGES ON neutron.* TO <span style="color: #2aa198;">'neutron'</span>@<span style="color: #2aa198;">'%'</span> IDENTIFIED BY <span style="color: #2aa198;">'neutron'</span>;

GRANT ALL PRIVILEGES ON heat.* TO <span style="color: #2aa198;">'heat'</span>@<span style="color: #2aa198;">'localhost'</span> IDENTIFIED BY <span style="color: #2aa198;">'heat'</span>;
GRANT ALL PRIVILEGES ON heat.* TO <span style="color: #2aa198;">'heat'</span>@<span style="color: #2aa198;">'%'</span> IDENTIFIED BY <span style="color: #2aa198;">'heat'</span>;
</pre>

<p>
#重启mysql服务
</p>


<pre class="src src-sh">/etc/init.d/mysql restart
</pre>

</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> 安装rabbitmq</h3>
<div class="outline-text-3" id="text-5-2">




<pre class="src src-sh">apt-get install rabbitmq-server
</pre>

<p>
rabbitmq-server默认会创建一个用户，用户名密码均为guest，并允许任何人用guest用户和默认密码访问RabbitMQ server。
如果需要可以修改guest密码,命令:
</p>


<pre class="src src-sh">rabbitmqctl change_password guest NEW_PASS
</pre>

</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 安装和配置Keystone</h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> 安装</h3>
<div class="outline-text-3" id="text-6-1">




<pre class="src src-sh">apt-get install keystone
</pre>

</div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> 删除默认keystone的sqlite db 文件</h3>
<div class="outline-text-3" id="text-6-2">




<pre class="src src-sh">rm -f /var/lib/keystone/keystone.db
</pre>

</div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> 配置openssl</h3>
<div class="outline-text-3" id="text-6-3">

<p>在keystone与OpenStack服务之间如果要使用ssl进行token认证,就需要使用到openssl
</p>


<pre class="src src-sh">openssl rand -hex 10
cdccc11cf024bd7de58e
</pre>

</div>

</div>
