public_html/Openstack/openstack-havana-all-in-one-deploy.html

<div id="outline-container-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> 修改配置文件</h3>
<div class="outline-text-3" id="text-6-4">


</div>

<div id="outline-container-6-4-1" class="outline-4">
<h4 id="sec-6-4-1"><span class="section-number-4">6.4.1</span> 修改/etc/keystone/keystone.conf</h4>
<div class="outline-text-4" id="text-6-4-1">

<p>修改[DEFAULT]admin_token值， 修改[sql]的connection.
</p>


<pre class="src src-sh">[DEFAULT]
admin_token = cdccc11cf024bd7de58e
[sql]
<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">The SQLAlchemy connection string used to connect to the database</span>
connection = mysql://keystone:keystone@172.16.0.254/keystone
</pre>

</div>

</div>

<div id="outline-container-6-4-2" class="outline-4">
<h4 id="sec-6-4-2"><span class="section-number-4">6.4.2</span> 同步keystone表数据到db中并重启keystone</h4>
<div class="outline-text-4" id="text-6-4-2">




<pre class="src src-sh">keystone-manage db_sync
/etc/init.d/keystone restart
</pre>

</div>
</div>

</div>

<div id="outline-container-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> 创建tenant、user、roles</h3>
<div class="outline-text-3" id="text-6-5">


</div>

<div id="outline-container-6-5-1" class="outline-4">
<h4 id="sec-6-5-1"><span class="section-number-4">6.5.1</span> 首先创建两个环境变量</h4>
<div class="outline-text-4" id="text-6-5-1">




<pre class="src src-sh"><span style="color: #859900;">export</span> <span style="color: #268bd2;">OS_SERVICE_TOKEN</span>=cdccc11cf024bd7de58e
<span style="color: #859900;">export</span> <span style="color: #268bd2;">OS_SERVICE_ENDPOINT</span>=http://172.16.0.254:35357/v2.0
</pre>

</div>

</div>

<div id="outline-container-6-5-2" class="outline-4">
<h4 id="sec-6-5-2"><span class="section-number-4">6.5.2</span> 创建admin和service两个租户</h4>
<div class="outline-text-4" id="text-6-5-2">




<pre class="src src-sh">keystone tenant-create --name=admin --description=<span style="color: #2aa198;">"Admin Tenant"</span>
keystone tenant-create --name=service --description=<span style="color: #2aa198;">"Service Tenant"</span>
</pre>

</div>

</div>

<div id="outline-container-6-5-3" class="outline-4">
<h4 id="sec-6-5-3"><span class="section-number-4">6.5.3</span> 创建用户admin，密码password</h4>
<div class="outline-text-4" id="text-6-5-3">




<pre class="src src-sh">keystone user-create --name=admin --pass=password --email=admin@example.com
</pre>

</div>

</div>

<div id="outline-container-6-5-4" class="outline-4">
<h4 id="sec-6-5-4"><span class="section-number-4">6.5.4</span> 创建角色admin</h4>
<div class="outline-text-4" id="text-6-5-4">




<pre class="src src-sh">keystone role-create --name=admin
</pre>

</div>

</div>

<div id="outline-container-6-5-5" class="outline-4">
<h4 id="sec-6-5-5"><span class="section-number-4">6.5.5</span> 关联用户、角色、租户</h4>
<div class="outline-text-4" id="text-6-5-5">




<pre class="src src-sh">keystone user-role-add --user=admin --tenant=admin --role=admin
</pre>

</div>
</div>

</div>

<div id="outline-container-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> 创建Services 及 API endpoints</h3>
<div class="outline-text-3" id="text-6-6">

<p>首先创建一个类型为identity的keystone服务，名称为keystone：
</p>


<pre class="src src-sh"><span style="color: #268bd2;">keystone_id</span>=$(<span style="color: #fa8072;">keystone</span> service-create --name=keystone --type=identity <span style="color: #2aa198;">\</span>
--description=<span style="color: #2aa198;">"Keystone Identity Service"</span> | awk <span style="color: #2aa198;">'/ id / { print $4 }'</span>)
</pre>

<p>
创建endpoint
</p>


<pre class="src src-sh">keystone endpoint-create <span style="color: #2aa198;">\</span>
--service-id=$<span style="color: #268bd2;">keystone_id</span> <span style="color: #2aa198;">\</span>
--publicurl=http://172.16.0.254:5000/v2.0 <span style="color: #2aa198;">\</span>
--internalurl=http://172.16.0.254:5000/v2.0 <span style="color: #2aa198;">\</span>
--adminurl=http://172.16.0.254:35357/v2.0
</pre>

</div>

</div>

<div id="outline-container-6-7" class="outline-3">
<h3 id="sec-6-7"><span class="section-number-3">6.7</span> 验证认证服务(Keystone)安装是否成功</h3>
<div class="outline-text-3" id="text-6-7">

<p>先unset之前的环境变量：
</p>


<pre class="src src-sh"><span style="color: #859900;">unset</span> OS_SERVICE_TOKEN OS_SERVICE_ENDPOINT
</pre>

<p>
创建keystonerc文件(环境变量)
</p>


<pre class="src src-sh">cat &gt; /root/openrc.sh &lt;&lt; _EOF_
<span style="color: #ffff00; font-weight: bold;">export OS_USERNAME=admin</span>
<span style="color: #ffff00; font-weight: bold;">export OS_PASSWORD=password</span>
<span style="color: #ffff00; font-weight: bold;">export OS_TENANT_NAME=admin</span>
<span style="color: #ffff00; font-weight: bold;">export OS_AUTH_URL=http://172.16.0.254:35357/v2.0</span>
<span style="color: #ffff00; font-weight: bold;">_EOF_</span>
<span style="color: #859900;">echo</span> <span style="color: #2aa198;">'source /root/openrc.sh'</span> &gt;&gt; /root/.bashrc
<span style="color: #859900;">source</span> /root/openrc.sh
</pre>

<p>
验证keystone是否正常
</p>


<pre class="src src-sh">keystone token-get
keystone user-list
keystone role-list
keystone tenant-list
keystone endpoint-list
</pre>

</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 安装和配置glance</h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> 安装</h3>
<div class="outline-text-3" id="text-7-1">




<pre class="src src-sh">apt-get install glance python-glanceclient sheepdog
</pre>

<p>
删除 glance sqlite 文件：
</p>


<pre class="src src-sh">rm -f /var/lib/glance/glance.sqlite
</pre>

</div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> 修改glance配置文件</h3>
<div class="outline-text-3" id="text-7-2">

<p>修改/etc/glance/glance-api.conf
</p>


<pre class="src src-sh">verbose = True
debug = True
sql_connection = mysql://glance:glance@172.16.0.254/glance

notifier_strategy = rabbit
rabbit_host = 172.16.0.254
rabbit_password = guest

[keystone_authtoken]
auth_host = 172.16.0.254
auth_port = 35357
auth_protocol = http
admin_tenant_name = service
admin_user = glance
admin_password = glance
</pre>

<p>
修改/etc/glance/glance-registry.conf
</p>


<pre class="src src-sh">verbose = True
debug = True
sql_connection = mysql://glance:glance@172.16.0.254/glance
[keystone_authtoken]
auth_host = 172.16.0.254
auth_port = 35357
auth_protocol = http
admin_tenant_name = service
admin_user = glance
admin_password = glance
</pre>

<p>
/etc/glance/glance-api-paste.ini
</p>


<pre class="src src-sh">[filter:authtoken]
paste.filter_factory=keystoneclient.middleware.auth_token:filter_factory
<span style="color: #268bd2;">auth_host</span>=172.16.0.254
<span style="color: #268bd2;">admin_user</span>=glance
<span style="color: #268bd2;">admin_tenant_name</span>=service
<span style="color: #268bd2;">admin_password</span>=glance
<span style="color: #268bd2;">flavor</span>=keystone
</pre>

<p>
/etc/glance/glance-registry-paste.ini
</p>


<pre class="src src-sh">[filter:authtoken]
paste.filter_factory=keystoneclient.middleware.auth_token:filter_factory
<span style="color: #268bd2;">auth_host</span>=172.16.0.254
<span style="color: #268bd2;">admin_user</span>=glance
<span style="color: #268bd2;">admin_tenant_name</span>=service
<span style="color: #268bd2;">admin_password</span>=glance
<span style="color: #268bd2;">flavor</span>=keystone
</pre>

</div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> 同步数据库</h3>
<div class="outline-text-3" id="text-7-3">




<pre class="src src-sh">glance-manage db_sync
</pre>

</div>

</div>

<div id="outline-container-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="section-number-3">7.4</span> 创建名为glance的认证用户</h3>
<div class="outline-text-3" id="text-7-4">




<pre class="src src-sh">keystone user-create --name=glance --pass=glance --email=glance@example.com
keystone user-role-add --user=glance --tenant=service --role=admin
</pre>

</div>

</div>

<div id="outline-container-7-5" class="outline-3">
<h3 id="sec-7-5"><span class="section-number-3">7.5</span> 创建service服务和endpoint</h3>
<div class="outline-text-3" id="text-7-5">




<pre class="src src-sh"><span style="color: #268bd2;">glance_id</span>=$(<span style="color: #fa8072;">keystone</span> service-create --name=glance --type=image <span style="color: #2aa198;">\</span>
--description=<span style="color: #2aa198;">"Glance Image Service"</span> | awk <span style="color: #2aa198;">'/ id / { print $4 }'</span>)

keystone endpoint-create <span style="color: #2aa198;">\</span>
--service-id=$<span style="color: #268bd2;">glance_id</span> <span style="color: #2aa198;">\</span>
--publicurl=http://172.16.0.254:9292 <span style="color: #2aa198;">\</span>
--internalurl=http://172.16.0.254:9292 <span style="color: #2aa198;">\</span>
--adminurl=http://172.16.0.254:9292
</pre>

</div>

</div>

<div id="outline-container-7-6" class="outline-3">
<h3 id="sec-7-6"><span class="section-number-3">7.6</span> 重启glance服务</h3>
<div class="outline-text-3" id="text-7-6">




<pre class="src src-sh">service glance-registry restart
service glance-api restart
</pre>

</div>

</div>

<div id="outline-container-7-7" class="outline-3">
<h3 id="sec-7-7"><span class="section-number-3">7.7</span> 上传镜像</h3>
<div class="outline-text-3" id="text-7-7">

<p>下载测试镜像
</p>


<pre class="src src-sh">wget http://cdn.download.cirros-cloud.net/0.3.1/cirros-0.3.1-x86_64-disk.img
</pre>

<p>
上传
</p>


<pre class="src src-sh">glance image-create --name=<span style="color: #2aa198;">'cirros'</span> --is-public true --container-format bare --disk-format qcow2 &lt; ./cirros-0.3.0-x86_64-disk.img
</pre>

<p>
查看上传的镜像
</p>


<pre class="src src-sh">glance image-list
</pre>

</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 安装和配置nova</h2>
<div class="outline-text-2" id="text-8">


</div>

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> 安装计算服务</h3>
<div class="outline-text-3" id="text-8-1">




<pre class="src src-sh">apt-get install nova-novncproxy novnc nova-api python-novaclient <span style="color: #2aa198;">\</span>
nova-ajax-console-proxy nova-cert nova-conductor <span style="color: #2aa198;">\</span>
nova-consoleauth nova-doc nova-scheduler
apt-get install nova-compute-kvm python-guestfs
</pre>

<p>
安装过程会提示你,选择”yes”即可。
</p></div>

</div>

<div id="outline-container-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> 修复guestfs的一个bug</h3>
<div class="outline-text-3" id="text-8-2">




<pre class="src src-sh">chmod 0644 /boot/vmlinuz*
</pre>

</div>

</div>
