www/Openstack/openstack-havana-all-in-one-deploy.org
** 删除默认nova的sqlite db文件
#+BEGIN_SRC sh
rm -f /var/lib/nova/nova.sqlite
#+END_SRC
** 修改配置文件
修改/etc/nova/nova.conf，原有基础上添加
#+BEGIN_SRC sh
[DEFAULT]
#vnc
my_ip=172.16.0.254
vnc_enabled=True
vncserver_listen=0.0.0.0
vncserver_proxyclient_address=172.16.0.254
novncproxy_base_url=http://192.168.60.108:6080/vnc_auto.html

#Messaging
rpc_backend = nova.rpc.impl_kombu
rabbit_host = 172.16.0.254
rabbit_password = guest

#Glance
glance_host = 172.16.0.254

#Auth
auth_strategy=keystone

#Nova Metadata
neutron_metadata_proxy_shared_secret = cdccc11cf024bd7de58e
service_neutron_metadata_proxy = true

#Ceilometer
instance_usage_audit=True
instance_usage_audit_period=hour
notify_on_state_change=vm_and_task_state
notification_driver=nova.openstack.common.notifier.rpc_notifier
notification_driver=ceilometer.compute.nova_notifier

#neutron
network_api_class=nova.network.neutronv2.api.API
neutron_url=http://172.16.0.254:9696
neutron_auth_strategy=keystone
neutron_admin_tenant_name=service
neutron_admin_username=neutron
neutron_admin_password=neutron
neutron_admin_auth_url=http://172.16.0.254:35357/v2.0
#如果没有libvirt_vif_driver将不会有qvb等设备
libvirt_vif_driver = nova.virt.libvirt.vif.LibvirtHybridOVSBridgeDriver
linuxnet_interface_driver = nova.network.linux_net.LinuxOVSInterfaceDriver
#firewall_driver=nova.virt.firewall.NoopFirewallDriver
firewall_driver=nova.virt.libvirt.firewall.IptablesFirewallDriver
security_group_api=neutron

[database]
connection = mysql://nova:nova@172.16.0.254/nova

[keystone_authtoken]
auth_host = 172.16.0.254
auth_port = 35357
auth_protocol = http
admin_tenant_name = service
admin_user = nova
admin_password = nova

#+END_SRC
修改/etc/nova/api-paste.ini的[filter:authtoken]部分
#+BEGIN_SRC sh
[filter:authtoken]
paste.filter_factory = keystoneclient.middleware.auth_token:filter_factory
auth_host = 172.16.0.254
auth_port = 35357
auth_protocol = http
auth_uri = http://172.16.0.254:5000/v2.0
admin_tenant_name = service
admin_user = nova
admin_password = nova
#+END_SRC
** 创建用户与角色
#+BEGIN_SRC sh
keystone user-create --name=nova --pass=nova --email=nova@example.com
keystone user-role-add --user=nova --tenant=service --role=admin
#+END_SRC
** 创建service服务和endpoint
#+BEGIN_SRC sh
nova_id=$(keystone service-create --name=nova --type=compute \
--description="Nova Compute service" | awk '/ id / { print $4 }')

keystone endpoint-create \
--service-id=$nova_id \
--publicurl=http://172.16.0.254:8774/v2/%\(tenant_id\)s \
--internalurl=http://172.16.0.254:8774/v2/%\(tenant_id\)s \
--adminurl=http://172.16.0.254:8774/v2/%\(tenant_id\)s
#+END_SRC
** 重启nova服务
同步数据
#+BEGIN_SRC sh
nova-manage db sync
#+END_SRC
重启服务
#+BEGIN_SRC sh
cd /etc/init.d/; for i in $( ls nova-* ); do sudo service $i restart; done
#+END_SRC
#查看服务状态
#+BEGIN_SRC sh
nova-manage service list
Binary           Host                                 Zone             Status     State Updated_At
nova-cert        ubuntu                               internal         enabled    :-)   2013-12-24 05:39:29
nova-conductor   ubuntu                               internal         enabled    :-)   2013-12-24 05:39:27
nova-consoleauth ubuntu                               internal         enabled    :-)   2013-12-24 05:39:30
nova-compute     ubuntu                               nova             enabled    :-)   2013-12-24 05:39:27
nova-scheduler   ubuntu                               internal         enabled    :-)   2013-12-24 05:39:30
#+END_SRC
应该看到5个:)

测试nova是否安装正常
#+BEGIN_SRC sh
nova image-list
#+END_SRC
* Block Storage (Cinder)安装
** 安装服务
#+BEGIN_SRC sh
apt-get install cinder-api cinder-scheduler
#+END_SRC
** 建立一个逻辑卷卷组 cinder-volumes
创建一个普通分区，我这里用的sdb，创建了一个主分区，大小为所有空间
#+BEGIN_SRC sh
apt-get install cinder-volume lvm2
# fdisk /dev/sdb
n
p
1
Enter
Enter
t
8e
w
# pvcreate /dev/sdb1
# vgcreate cinder-volumes /dev/sdb1
# vgs
  VG             #PV #LV #SN Attr   VSize  VFree 
  cinder-volumes   1   0   0 wz--n- 10.00g 10.00g
  #+END_SRC
** 修改配置文件
/etc/cinder/cinder.conf，添加
#+BEGIN_SRC sh
sql_connection = mysql://cinder:cinder@172.16.0.254/cinder

rpc_backend = cinder.openstack.common.rpc.impl_kombu
rabbit_host = 172.16.0.254
rabbit_port = 5672
rabbit_userid = guest
rabbit_password = guest

control_exchange = cinder
notification_driver = cinder.openstack.common.notifier.rpc_notifier
#+END_SRC
/etc/cinder/api-paste.ini
#+BEGIN_SRC sh
[filter:authtoken]
paste.filter_factory=keystoneclient.middleware.auth_token:filter_factory
auth_host=172.16.0.254
auth_port = 35357
auth_protocol = http
admin_tenant_name = service
admin_user = cinder
admin_password = cinder
#+END_SRC
