public_html/Openstack/openstack-havana-all-in-one-deploy.html

<div id="outline-container-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> 删除默认nova的sqlite db文件</h3>
<div class="outline-text-3" id="text-8-3">




<pre class="src src-sh">rm -f /var/lib/nova/nova.sqlite
</pre>

</div>

</div>

<div id="outline-container-8-4" class="outline-3">
<h3 id="sec-8-4"><span class="section-number-3">8.4</span> 修改配置文件</h3>
<div class="outline-text-3" id="text-8-4">

<p>修改/etc/nova/nova.conf，原有基础上添加
</p>


<pre class="src src-sh">[DEFAULT]
<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">vnc</span>
<span style="color: #268bd2;">my_ip</span>=172.16.0.254
<span style="color: #268bd2;">vnc_enabled</span>=True
<span style="color: #268bd2;">vncserver_listen</span>=0.0.0.0
<span style="color: #268bd2;">vncserver_proxyclient_address</span>=172.16.0.254
<span style="color: #268bd2;">novncproxy_base_url</span>=http://192.168.60.108:6080/vnc_auto.html

<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">Messaging</span>
rpc_backend = nova.rpc.impl_kombu
rabbit_host = 172.16.0.254
rabbit_password = guest

<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">Glance</span>
glance_host = 172.16.0.254

<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">Auth</span>
<span style="color: #268bd2;">auth_strategy</span>=keystone

<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">Nova Metadata</span>
neutron_metadata_proxy_shared_secret = cdccc11cf024bd7de58e
service_neutron_metadata_proxy = true

<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">Ceilometer</span>
<span style="color: #268bd2;">instance_usage_audit</span>=True
<span style="color: #268bd2;">instance_usage_audit_period</span>=hour
<span style="color: #268bd2;">notify_on_state_change</span>=vm_and_task_state
<span style="color: #268bd2;">notification_driver</span>=nova.openstack.common.notifier.rpc_notifier
<span style="color: #268bd2;">notification_driver</span>=ceilometer.compute.nova_notifier

<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">neutron</span>
<span style="color: #268bd2;">network_api_class</span>=nova.network.neutronv2.api.API
<span style="color: #268bd2;">neutron_url</span>=http://172.16.0.254:9696
<span style="color: #268bd2;">neutron_auth_strategy</span>=keystone
<span style="color: #268bd2;">neutron_admin_tenant_name</span>=service
<span style="color: #268bd2;">neutron_admin_username</span>=neutron
<span style="color: #268bd2;">neutron_admin_password</span>=neutron
<span style="color: #268bd2;">neutron_admin_auth_url</span>=http://172.16.0.254:35357/v2.0
<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">&#22914;&#26524;&#27809;&#26377;libvirt_vif_driver&#23558;&#19981;&#20250;&#26377;qvb&#31561;&#35774;&#22791;</span>
libvirt_vif_driver = nova.virt.libvirt.vif.LibvirtHybridOVSBridgeDriver
linuxnet_interface_driver = nova.network.linux_net.LinuxOVSInterfaceDriver
<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">firewall_driver=nova.virt.firewall.NoopFirewallDriver</span>
<span style="color: #268bd2;">firewall_driver</span>=nova.virt.libvirt.firewall.IptablesFirewallDriver
<span style="color: #268bd2;">security_group_api</span>=neutron

[database]
connection = mysql://nova:nova@172.16.0.254/nova

[keystone_authtoken]
auth_host = 172.16.0.254
auth_port = 35357
auth_protocol = http
admin_tenant_name = service
admin_user = nova
admin_password = nova

</pre>

<p>
修改/etc/nova/api-paste.ini的[filter:authtoken]部分
</p>


<pre class="src src-sh">[filter:authtoken]
paste.filter_factory = keystoneclient.middleware.auth_token:filter_factory
auth_host = 172.16.0.254
auth_port = 35357
auth_protocol = http
auth_uri = http://172.16.0.254:5000/v2.0
admin_tenant_name = service
admin_user = nova
admin_password = nova
</pre>

</div>

</div>

<div id="outline-container-8-5" class="outline-3">
<h3 id="sec-8-5"><span class="section-number-3">8.5</span> 创建用户与角色</h3>
<div class="outline-text-3" id="text-8-5">




<pre class="src src-sh">keystone user-create --name=nova --pass=nova --email=nova@example.com
keystone user-role-add --user=nova --tenant=service --role=admin
</pre>

</div>

</div>

<div id="outline-container-8-6" class="outline-3">
<h3 id="sec-8-6"><span class="section-number-3">8.6</span> 创建service服务和endpoint</h3>
<div class="outline-text-3" id="text-8-6">




<pre class="src src-sh"><span style="color: #268bd2;">nova_id</span>=$(<span style="color: #fa8072;">keystone</span> service-create --name=nova --type=compute <span style="color: #2aa198;">\</span>
--description=<span style="color: #2aa198;">"Nova Compute service"</span> | awk <span style="color: #2aa198;">'/ id / { print $4 }'</span>)

keystone endpoint-create <span style="color: #2aa198;">\</span>
--service-id=$<span style="color: #268bd2;">nova_id</span> <span style="color: #2aa198;">\</span>
--publicurl=http://172.16.0.254:8774/v2/%<span style="color: #2aa198;">\(</span>tenant_id<span style="color: #2aa198;">\)</span>s <span style="color: #2aa198;">\</span>
--internalurl=http://172.16.0.254:8774/v2/%<span style="color: #2aa198;">\(</span>tenant_id<span style="color: #2aa198;">\)</span>s <span style="color: #2aa198;">\</span>
--adminurl=http://172.16.0.254:8774/v2/%<span style="color: #2aa198;">\(</span>tenant_id<span style="color: #2aa198;">\)</span>s
</pre>

</div>

</div>

<div id="outline-container-8-7" class="outline-3">
<h3 id="sec-8-7"><span class="section-number-3">8.7</span> 重启nova服务</h3>
<div class="outline-text-3" id="text-8-7">

<p>同步数据
</p>


<pre class="src src-sh">nova-manage db sync
</pre>

<p>
重启服务
</p>


<pre class="src src-sh"><span style="color: #859900;">cd</span> /etc/init.d/; <span style="color: #859900;">for</span> i<span style="color: #859900;"> in</span> $( ls nova-* ); <span style="color: #859900;">do</span> sudo service $<span style="color: #268bd2;">i</span> restart; <span style="color: #859900;">done</span>
</pre>

<p>
#查看服务状态
</p>


<pre class="src src-sh">nova-manage service list
Binary           Host                                 Zone             Status     State Updated_At
nova-cert        ubuntu                               internal         enabled    :-)   2013-12-24 05:39:29
nova-conductor   ubuntu                               internal         enabled    :-)   2013-12-24 05:39:27
nova-consoleauth ubuntu                               internal         enabled    :-)   2013-12-24 05:39:30
nova-compute     ubuntu                               nova             enabled    :-)   2013-12-24 05:39:27
nova-scheduler   ubuntu                               internal         enabled    :-)   2013-12-24 05:39:30
</pre>

<p>
应该看到5个:)
</p>
<p>
测试nova是否安装正常
</p>


<pre class="src src-sh">nova image-list
</pre>

</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Block Storage (Cinder)安装</h2>
<div class="outline-text-2" id="text-9">


</div>

<div id="outline-container-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> 安装服务</h3>
<div class="outline-text-3" id="text-9-1">




<pre class="src src-sh">apt-get install cinder-api cinder-scheduler
</pre>

</div>

</div>

<div id="outline-container-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> 建立一个逻辑卷卷组 cinder-volumes</h3>
<div class="outline-text-3" id="text-9-2">

<p>创建一个普通分区，我这里用的sdb，创建了一个主分区，大小为所有空间
</p>


<pre class="src src-sh">apt-get install cinder-volume lvm2
<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">fdisk /dev/sdb</span>
n
p
1
Enter
Enter
t
8e
w
<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">pvcreate /dev/sdb1</span>
<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">vgcreate cinder-volumes /dev/sdb1</span>
<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">vgs</span>
  VG             <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">PV #LV #SN Attr   VSize  VFree</span><span style="background-color: #ffd700;"> </span>
  cinder-volumes   1   0   0 wz--n- 10.00g 10.00g
</pre>

</div>

</div>

<div id="outline-container-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="section-number-3">9.3</span> 修改配置文件</h3>
<div class="outline-text-3" id="text-9-3">

<p>/etc/cinder/cinder.conf，添加
</p>


<pre class="src src-sh">sql_connection = mysql://cinder:cinder@172.16.0.254/cinder

rpc_backend = cinder.openstack.common.rpc.impl_kombu
rabbit_host = 172.16.0.254
rabbit_port = 5672
rabbit_userid = guest
rabbit_password = guest

control_exchange = cinder
notification_driver = cinder.openstack.common.notifier.rpc_notifier
</pre>

<p>
/etc/cinder/api-paste.ini
</p>


<pre class="src src-sh">[filter:authtoken]
paste.filter_factory=keystoneclient.middleware.auth_token:filter_factory
<span style="color: #268bd2;">auth_host</span>=172.16.0.254
auth_port = 35357
auth_protocol = http
admin_tenant_name = service
admin_user = cinder
admin_password = cinder
</pre>

</div>

</div>
