www/Openstack/openstack-havana-all-in-one-deploy.org
** 创建用户，角色，服务和endpoint
#+BEGIN_SRC sh
keystone user-create --name=cinder --pass=cinder --email=cinder@example.com
keystone user-role-add --user=cinder --tenant=service --role=admin

cinder_id1=$(keystone service-create --name=cinder --type=volume \
--description="Cinder Volume Service" | awk '/ id / { print $4 }')
keystone endpoint-create \
--service-id=$cinder_id1 \
--publicurl=http://172.16.0.254:8776/v1/%\(tenant_id\)s \
--internalurl=http://172.16.0.254:8776/v1/%\(tenant_id\)s \
--adminurl=http://172.16.0.254:8776/v1/%\(tenant_id\)s

cinder_id2=$(keystone service-create --name=cinder --type=volumev2 \
--description="Cinder Volume Service V2" | awk '/ id / { print $4 }')
keystone endpoint-create \
--service-id=$cinder_id2 \
--publicurl=http://172.16.0.254:8776/v2/%\(tenant_id\)s \
--internalurl=http://172.16.0.254:8776/v2/%\(tenant_id\)s \
--adminurl=http://172.16.0.254:8776/v2/%\(tenant_id\)s
#+END_SRC
** 同步数据并重启服务
#+BEGIN_SRC sh
cinder-manage db sync
service cinder-scheduler restart
service cinder-api restart
service cinder-volume restart
service tgt restart
#+END_SRC
** 检查
#+BEGIN_SRC sh
cinder list #无输出
#+END_SRC
* 安装和配置neutron
** 创建用户，服务和endpoint
#+BEGIN_SRC sh
keystone user-create --name=neutron --pass=neutron --email=neutron@example.com
keystone user-role-add --user=neutron --tenant=service --role=admin

neutron_id=$(keystone service-create --name=neutron --type=network \
--description="OpenStack Networking Service" | awk '/ id / { print $4 }')
keystone endpoint-create \
--service-id $neutron_id \
--publicurl http://172.16.0.254:9696 \
--adminurl http://172.16.0.254:9696 \
--internalurl http://172.16.0.254:9696
#+END_SRC
** 安装网络服务
*** 安装neutron组件
#+BEGIN_SRC sh
apt-get install neutron-server neutron-dhcp-agent  neutron-l3-agent neutron-lbaas-agent
#+END_SRC
*** 打开ip_forward
编辑/etc/sysctl.conf
#+BEGIN_SRC sh
net.ipv4.ip_forward=1
net.ipv4.conf.all.rp_filter=0
net.ipv4.conf.default.rp_filter=0
#+END_SRC
重启网络
#+BEGIN_SRC sh
sysctl -p
/etc/init.d/networking restart
#+END_SRC
*** 编辑配置文件
编辑/etc/neutron/neutron.conf 
#+BEGIN_SRC sh
[DEFAULT]
debug = True
verbose = True
allow_overlapping_ips = True

core_plugin = neutron.plugins.openvswitch.ovs_neutron_plugin.OVSNeutronPluginV2
service_plugins = neutron.plugins.services.agent_loadbalancer.plugin.LoadBalancerPlugin
service_plugins = neutron.services.firewall.fwaas_plugin.FirewallPlugin

api_paste_config = /etc/neutron/api-paste.ini

auth_strategy = keystone

rpc_backend = neutron.openstack.common.rpc.impl_kombu
rabbit_host = 172.16.0.254
rabbit_port = 5672
rabbit_userid = guest
rabbit_password = guest

[keystone_authtoken]
auth_host = 172.16.0.254
auth_port = 35357
auth_protocol = http
auth_url = http://172.16.0.254:35357/v2.0
admin_tenant_name = service
admin_user = neutron
admin_password = neutron

[database]
connection = mysql://neutron:neutron@172.16.0.254/neutron
#+END_SRC
编辑/etc/neutron/api-paste.ini
#+BEGIN_SRC sh
[filter:authtoken]
paste.filter_factory = keystoneclient.middleware.auth_token:filter_factory
auth_host=172.16.0.254
auth_uri=http://172.16.0.254:5000
admin_user=neutron
admin_tenant_name=service
admin_password=neutron
#+END_SRC
编辑/etc/neutron/dhcp_agent.ini
#+BEGIN_SRC sh
dhcp_driver = neutron.agent.linux.dhcp.Dnsmasq
use_namespaces = True
interface_driver = neutron.agent.linux.interface.OVSInterfaceDriver
#+END_SRC
编辑/etc/neutron/l3_agent.ini
#+BEGIN_SRC sh
auth_url = http://172.16.0.254:35357/v2.0
admin_tenant_name = service
admin_user = neutron
admin_password = neutron
metadata_ip = 172.16.0.254
use_namespaces = True
interface_driver = neutron.agent.linux.interface.OVSInterfaceDriver
#+END_SRC
编辑/etc/neutron/metadata_agent.ini
#+BEGIN_SRC sh
[DEFAULT]
auth_url = http://172.16.0.254:5000/v2.0
auth_region = regionOne
admin_tenant_name = service
admin_user = neutron
admin_password = neutron
nova_metadata_ip = 172.16.0.254
metadata_proxy_shared_secret = cdccc11cf024bd7de58e
#+END_SRC
编辑/etc/neutron/lbaas_agent.ini
#+BEGIN_SRC sh
interface_driver = neutron.agent.linux.interface.OVSInterfaceDriver
device_driver = neutron.services.loadbalancer.drivers.haproxy.namespace_driver.HaproxyNSDriver
#+END_SRC
创建/etc/neutron/fwaas_driver.ini
#+BEGIN_SRC sh
[fwaas]
driver = neutron.services.firewall.drivers.linux.iptables_fwaas.IptablesFwaasDriver
enabled = True
#+END_SRC
编辑/etc/init/neutron-l3-agent 补充--config file fwaas_driver.ini
#+BEGIN_SRC sh
exec start-stop-daemon --start --chuid neutron --exec /usr/bin/neutron-l3-agent -- --config-file=/etc/neutron/neutron.conf --config-file=/etc/neutron/l3_agent.ini --config-file /etc/neutron/fwaas_driver.ini --log-file=/var/log/neutron/l3-agent.log
#+END_SRC
** 安装ovs插件
*** 安装
#+BEGIN_SRC sh
apt-get install openvswitch-datapath-dkms openvswitch-switch neutron-plugin-openvswitch-agent
service openvswitch-switch restart
#+END_SRC
*** 网络配置
**** 建立网桥
#+BEGIN_SRC sh
ovs-vsctl add-br br-int
ovs-vsctl add-br br-ex
ovs-vsctl add-port br-ex eth0
#+END_SRC
**** 编辑配置/etc/network/interfaces
#+BEGIN_SRC sh
auto lo
iface lo inet loopback

auto eth1
iface eth0 inet static
        address 172.16.0.254
        netmask 255.255.255.0

auto eth0
iface eth0 inet manual
        up ifconfig $IFACE 0.0.0.0 up
        down ifconfig $IFACE down

auto br-ex
iface br-ex inet static
        address 192.168.60.108
        netmask 255.255.255.0
        gateway 192.168.60.1
        dns-nameservers 8.8.8.8
#+END_SRC
**** 重启网络
#+BEGIN_SRC sh
ifconfig eth0 0
/etc/init.d/networking restart
#+END_SRC
