public_html/Openstack/openstack-havana-all-in-one-deploy.html

<div id="outline-container-9-4" class="outline-3">
<h3 id="sec-9-4"><span class="section-number-3">9.4</span> 创建用户，角色，服务和endpoint</h3>
<div class="outline-text-3" id="text-9-4">




<pre class="src src-sh">keystone user-create --name=cinder --pass=cinder --email=cinder@example.com
keystone user-role-add --user=cinder --tenant=service --role=admin

<span style="color: #268bd2;">cinder_id1</span>=$(<span style="color: #fa8072;">keystone</span> service-create --name=cinder --type=volume <span style="color: #2aa198;">\</span>
--description=<span style="color: #2aa198;">"Cinder Volume Service"</span> | awk <span style="color: #2aa198;">'/ id / { print $4 }'</span>)
keystone endpoint-create <span style="color: #2aa198;">\</span>
--service-id=$<span style="color: #268bd2;">cinder_id1</span> <span style="color: #2aa198;">\</span>
--publicurl=http://172.16.0.254:8776/v1/%<span style="color: #2aa198;">\(</span>tenant_id<span style="color: #2aa198;">\)</span>s <span style="color: #2aa198;">\</span>
--internalurl=http://172.16.0.254:8776/v1/%<span style="color: #2aa198;">\(</span>tenant_id<span style="color: #2aa198;">\)</span>s <span style="color: #2aa198;">\</span>
--adminurl=http://172.16.0.254:8776/v1/%<span style="color: #2aa198;">\(</span>tenant_id<span style="color: #2aa198;">\)</span>s

<span style="color: #268bd2;">cinder_id2</span>=$(<span style="color: #fa8072;">keystone</span> service-create --name=cinder --type=volumev2 <span style="color: #2aa198;">\</span>
--description=<span style="color: #2aa198;">"Cinder Volume Service V2"</span> | awk <span style="color: #2aa198;">'/ id / { print $4 }'</span>)
keystone endpoint-create <span style="color: #2aa198;">\</span>
--service-id=$<span style="color: #268bd2;">cinder_id2</span> <span style="color: #2aa198;">\</span>
--publicurl=http://172.16.0.254:8776/v2/%<span style="color: #2aa198;">\(</span>tenant_id<span style="color: #2aa198;">\)</span>s <span style="color: #2aa198;">\</span>
--internalurl=http://172.16.0.254:8776/v2/%<span style="color: #2aa198;">\(</span>tenant_id<span style="color: #2aa198;">\)</span>s <span style="color: #2aa198;">\</span>
--adminurl=http://172.16.0.254:8776/v2/%<span style="color: #2aa198;">\(</span>tenant_id<span style="color: #2aa198;">\)</span>s
</pre>

</div>

</div>

<div id="outline-container-9-5" class="outline-3">
<h3 id="sec-9-5"><span class="section-number-3">9.5</span> 同步数据并重启服务</h3>
<div class="outline-text-3" id="text-9-5">




<pre class="src src-sh">cinder-manage db sync
service cinder-scheduler restart
service cinder-api restart
service cinder-volume restart
service tgt restart
</pre>

</div>

</div>

<div id="outline-container-9-6" class="outline-3">
<h3 id="sec-9-6"><span class="section-number-3">9.6</span> 检查</h3>
<div class="outline-text-3" id="text-9-6">




<pre class="src src-sh">cinder list <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">&#26080;&#36755;&#20986;</span>
</pre>

</div>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> 安装和配置neutron</h2>
<div class="outline-text-2" id="text-10">


</div>

<div id="outline-container-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> 创建用户，服务和endpoint</h3>
<div class="outline-text-3" id="text-10-1">




<pre class="src src-sh">keystone user-create --name=neutron --pass=neutron --email=neutron@example.com
keystone user-role-add --user=neutron --tenant=service --role=admin

<span style="color: #268bd2;">neutron_id</span>=$(<span style="color: #fa8072;">keystone</span> service-create --name=neutron --type=network <span style="color: #2aa198;">\</span>
--description=<span style="color: #2aa198;">"OpenStack Networking Service"</span> | awk <span style="color: #2aa198;">'/ id / { print $4 }'</span>)
keystone endpoint-create <span style="color: #2aa198;">\</span>
--service-id $<span style="color: #268bd2;">neutron_id</span> <span style="color: #2aa198;">\</span>
--publicurl http://172.16.0.254:9696 <span style="color: #2aa198;">\</span>
--adminurl http://172.16.0.254:9696 <span style="color: #2aa198;">\</span>
--internalurl http://172.16.0.254:9696
</pre>

</div>

</div>

<div id="outline-container-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> 安装网络服务</h3>
<div class="outline-text-3" id="text-10-2">


</div>

<div id="outline-container-10-2-1" class="outline-4">
<h4 id="sec-10-2-1"><span class="section-number-4">10.2.1</span> 安装neutron组件</h4>
<div class="outline-text-4" id="text-10-2-1">




<pre class="src src-sh">apt-get install neutron-server neutron-dhcp-agent  neutron-l3-agent neutron-lbaas-agent
</pre>

</div>

</div>

<div id="outline-container-10-2-2" class="outline-4">
<h4 id="sec-10-2-2"><span class="section-number-4">10.2.2</span> 打开ip_forward</h4>
<div class="outline-text-4" id="text-10-2-2">

<p>编辑/etc/sysctl.conf
</p>


<pre class="src src-sh">net.ipv4.ip_forward=1
net.ipv4.conf.all.rp_filter=0
net.ipv4.conf.default.rp_filter=0
</pre>

<p>
重启网络
</p>


<pre class="src src-sh">sysctl -p
/etc/init.d/networking restart
</pre>

</div>

</div>

<div id="outline-container-10-2-3" class="outline-4">
<h4 id="sec-10-2-3"><span class="section-number-4">10.2.3</span> 编辑配置文件</h4>
<div class="outline-text-4" id="text-10-2-3">

<p>编辑/etc/neutron/neutron.conf 
</p>


<pre class="src src-sh">[DEFAULT]
debug = True
verbose = True
allow_overlapping_ips = True

core_plugin = neutron.plugins.openvswitch.ovs_neutron_plugin.OVSNeutronPluginV2
service_plugins = neutron.plugins.services.agent_loadbalancer.plugin.LoadBalancerPlugin
service_plugins = neutron.services.firewall.fwaas_plugin.FirewallPlugin

api_paste_config = /etc/neutron/api-paste.ini

auth_strategy = keystone

rpc_backend = neutron.openstack.common.rpc.impl_kombu
rabbit_host = 172.16.0.254
rabbit_port = 5672
rabbit_userid = guest
rabbit_password = guest

[keystone_authtoken]
auth_host = 172.16.0.254
auth_port = 35357
auth_protocol = http
auth_url = http://172.16.0.254:35357/v2.0
admin_tenant_name = service
admin_user = neutron
admin_password = neutron

[database]
connection = mysql://neutron:neutron@172.16.0.254/neutron
</pre>

<p>
编辑/etc/neutron/api-paste.ini
</p>


<pre class="src src-sh">[filter:authtoken]
paste.filter_factory = keystoneclient.middleware.auth_token:filter_factory
<span style="color: #268bd2;">auth_host</span>=172.16.0.254
<span style="color: #268bd2;">auth_uri</span>=http://172.16.0.254:5000
<span style="color: #268bd2;">admin_user</span>=neutron
<span style="color: #268bd2;">admin_tenant_name</span>=service
<span style="color: #268bd2;">admin_password</span>=neutron
</pre>

<p>
编辑/etc/neutron/dhcp_agent.ini
</p>


<pre class="src src-sh">dhcp_driver = neutron.agent.linux.dhcp.Dnsmasq
use_namespaces = True
interface_driver = neutron.agent.linux.interface.OVSInterfaceDriver
</pre>

<p>
编辑/etc/neutron/l3_agent.ini
</p>


<pre class="src src-sh">auth_url = http://172.16.0.254:35357/v2.0
admin_tenant_name = service
admin_user = neutron
admin_password = neutron
metadata_ip = 172.16.0.254
use_namespaces = True
interface_driver = neutron.agent.linux.interface.OVSInterfaceDriver
</pre>

<p>
编辑/etc/neutron/metadata_agent.ini
</p>


<pre class="src src-sh">[DEFAULT]
auth_url = http://172.16.0.254:5000/v2.0
auth_region = regionOne
admin_tenant_name = service
admin_user = neutron
admin_password = neutron
nova_metadata_ip = 172.16.0.254
metadata_proxy_shared_secret = cdccc11cf024bd7de58e
</pre>

<p>
编辑/etc/neutron/lbaas_agent.ini
</p>


<pre class="src src-sh">interface_driver = neutron.agent.linux.interface.OVSInterfaceDriver
device_driver = neutron.services.loadbalancer.drivers.haproxy.namespace_driver.HaproxyNSDriver
</pre>

<p>
创建/etc/neutron/fwaas_driver.ini
</p>


<pre class="src src-sh">[fwaas]
driver = neutron.services.firewall.drivers.linux.iptables_fwaas.IptablesFwaasDriver
enabled = True
</pre>

<p>
编辑/etc/init/neutron-l3-agent 补充&ndash;config file fwaas_driver.ini
</p>


<pre class="src src-sh"><span style="color: #859900;">exec</span> start-stop-daemon --start --chuid neutron --exec /usr/bin/neutron-l3-agent -- --config-file=/etc/neutron/neutron.conf --config-file=/etc/neutron/l3_agent.ini --config-file /etc/neutron/fwaas_driver.ini --log-file=/var/log/neutron/l3-agent.log
</pre>

</div>
</div>

</div>

<div id="outline-container-10-3" class="outline-3">
<h3 id="sec-10-3"><span class="section-number-3">10.3</span> 安装ovs插件</h3>
<div class="outline-text-3" id="text-10-3">


</div>

<div id="outline-container-10-3-1" class="outline-4">
<h4 id="sec-10-3-1"><span class="section-number-4">10.3.1</span> 安装</h4>
<div class="outline-text-4" id="text-10-3-1">




<pre class="src src-sh">apt-get install openvswitch-datapath-dkms openvswitch-switch neutron-plugin-openvswitch-agent
service openvswitch-switch restart
</pre>

</div>

</div>

<div id="outline-container-10-3-2" class="outline-4">
<h4 id="sec-10-3-2"><span class="section-number-4">10.3.2</span> 网络配置</h4>
<div class="outline-text-4" id="text-10-3-2">


</div>

<div id="outline-container-10-3-2-1" class="outline-5">
<h5 id="sec-10-3-2-1"><span class="section-number-5">10.3.2.1</span> 建立网桥</h5>
<div class="outline-text-5" id="text-10-3-2-1">




<pre class="src src-sh">ovs-vsctl add-br br-int
ovs-vsctl add-br br-ex
ovs-vsctl add-port br-ex eth0
</pre>

</div>

</div>

<div id="outline-container-10-3-2-2" class="outline-5">
<h5 id="sec-10-3-2-2"><span class="section-number-5">10.3.2.2</span> 编辑配置/etc/network/interfaces</h5>
<div class="outline-text-5" id="text-10-3-2-2">




<pre class="src src-sh">auto lo
iface lo inet loopback

auto eth1
iface eth0 inet static
        address 172.16.0.254
        netmask 255.255.255.0

auto eth0
iface eth0 inet manual
        up ifconfig $<span style="color: #268bd2;">IFACE</span> 0.0.0.0 up
        down ifconfig $<span style="color: #268bd2;">IFACE</span> down

auto br-ex
iface br-ex inet static
        address 192.168.60.108
        netmask 255.255.255.0
        gateway 192.168.60.1
        dns-nameservers 8.8.8.8
</pre>

</div>

</div>
