www/Openstack/openstack-havana-all-in-one-deploy.org
*** 编辑配置文件
编辑/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini
#+BEGIN_SRC sh
[securitygroup]
# Firewall driver for realizing neutron security group function.
firewall_driver = neutron.agent.linux.iptables_firewall.OVSHybridIptablesFirewallDriver
[ovs]
tenant_network_type = gre
tunnel_id_ranges = 1:1000
enable_tunneling = True
integration_bridge = br-int
tunnel_bridge = br-tun
local_ip = 172.16.0.254
#+END_SRC
** 重启服务
#+BEGIN_SRC sh
cd /etc/init.d/; for i in $( ls neutron-* ); do sudo service $i restart; done
#查看服务状态
neutron agent-list
+--------------------------------------+--------------------+--------+-------+----------------+
| id                                   | agent_type         | host   | alive | admin_state_up |
+--------------------------------------+--------------------+--------+-------+----------------+
| 6cc3719f-7c43-41c7-bc19-9839a362c321 | Open vSwitch agent | ubuntu | :-)   | True           |
| d96922b7-64a3-44f7-831f-1e9ea2033a33 | L3 agent           | ubuntu | :-)   | True           |
| ea701f27-1821-4134-9e6f-02acc8678e85 | DHCP agent         | ubuntu | :-)   | True           |
+--------------------------------------+--------------------+--------+-------+----------------+
#+END_SRC
* Orchestration Server(Heat)安装
** 安装
#+BEGIN_SRC sh
apt-get install heat-api heat-api-cfn heat-engine heat-api-cloudwatch
#+END_SRC
** 删除默认heat的sqlite db 文件
#+BEGIN_SRC sh
rm -f /var/lib/heat/heat.sqlite
#+END_SRC
** 编辑配置文件
/etc/heat/heat.conf
#+BEGIN_SRC sh
verbose = True
log_dir=/var/log/heat
rabbit_host = 172.16.0.254
rabbit_password = guest

# The SQLAlchemy connection string used to connect to the database
sql_connection = mysql://heat:heat@172.16.0.254/heat

[keystone_authtoken]
auth_host = 172.16.0.254
auth_port = 35357
auth_protocol = http
auth_uri = http://172.16.0.254:5000/v2.0
admin_tenant_name = service
admin_user = heat
admin_password = heat
[ec2_authtoken]
auth_uri = http://172.16.0.254:5000/v2.0
keystone_ec2_uri = http://172.16.0.254:5000/v2.0/ec2tokens
#+END_SRC
** 同步数据
#+BEGIN_SRC sh
heat-manage db_sync
#+END_SRC
** 创建用户和角色
#+BEGIN_SRC sh
keystone user-create --name=heat --pass=heat --email=heat@example.com
keystone user-role-add --user=heat --tenant=service --role=admin
#+END_SRC
** 创建服务和endpoint
#+BEGIN_SRC sh
heat_id=$(keystone service-create --name=heat --type=orchestration \
--description="Heat Orchestration API" | awk '/ id / { print $4 }')
keystone endpoint-create \
--service-id=$heat_id \
--publicurl=http://172.16.0.254:8004/v1/%\(tenant_id\)s \
--internalurl=http://172.16.0.254:8004/v1/%\(tenant_id\)s \
--adminurl=http://172.16.0.254:8004/v1/%\(tenant_id\)s

heat_cfn_id=$(keystone service-create --name=heat-cfn --type=cloudformation \
--description="Heat CloudFormation API" | awk '/ id / { print $4 }')
keystone endpoint-create \
--service-id=$heat_cfn_id \
--publicurl=http://172.16.0.254:8000/v1 \
--internalurl=http://172.16.0.254:8000/v1 \
--adminurl=http://172.16.0.254:8000/v1
#+END_SRC
** 重启服务
#+BEGIN_SRC sh
cd /etc/init.d/; for i in $( ls heat-* ); do sudo service $i restart; done
#+END_SRC
** 创建和管理stacks
#+BEGIN_SRC sh
wget https://raw.github.com/openstack/heat-templates/master/cfn/F17/WordPress_Composed_Instances.template
glance image-create --name F17-x86_64-cfntools --disk-format qcow2 --container-format bare --is-public True --copy-from http://fedorapeople.org/groups/heat/prebuilt-jeos-images/F17-x86_64-cfntools.qcow2
nova keypair-add heat_key > heat_key.priv
chmod 600 heat_key.priv
heat stack-create wordpress --template-file=WordPress_Composed_Instances.template --parameters="DBUsername=wp;DBPassword=wp;KeyName=userkey;LinuxDistribution=F17"
heat stack-list
#+END_SRC
PS:对heat还没有研究，创建stack是网上找的
* Metering/Monitoring Server（Ceilometer）安装
** 安装
安装服务
#+BEGIN_SRC sh
apt-get install ceilometer-api ceilometer-collector ceilometer-agent-central python-ceilometerclient ceilometer-agent-compute
#+END_SRC
安装MongoDB Orchestration 服务使用数据库来存储信息，此示例使用MongoDB数据库
#+BEGIN_SRC sh
apt-get install mongodb
#+END_SRC
** 创建数据库
运行mongo命令如果报错couldn't connect to server 127.0.0.1:27017 at src/mongo/shell/mongo.js:145
#+BEGIN_SRC sh
mongod --repair
service mongodb restart
#+END_SRC
#+BEGIN_SRC sh
mongo
> use ceilometer
> db.addUser( { user: "ceilometer",
pwd: "ceilometer",
roles: [ "readWrite", "dbAdmin" ]
} )
#+END_SRC
编辑/etc/mongodb.conf
#+BEGIN_SRC sh
bind_ip=0.0.0.0
#+END_SRC
重启数据库
#+BEGIN_SRC sh
service mongodb restart
#+END_SRC
