public_html/Openstack/openstack-havana-all-in-one-deploy.html

<div id="outline-container-10-3-2-3" class="outline-5">
<h5 id="sec-10-3-2-3"><span class="section-number-5">10.3.2.3</span> 重启网络</h5>
<div class="outline-text-5" id="text-10-3-2-3">




<pre class="src src-sh">ifconfig eth0 0
/etc/init.d/networking restart
</pre>

</div>
</div>

</div>

<div id="outline-container-10-3-3" class="outline-4">
<h4 id="sec-10-3-3"><span class="section-number-4">10.3.3</span> 编辑配置文件</h4>
<div class="outline-text-4" id="text-10-3-3">

<p>编辑/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini
</p>


<pre class="src src-sh">[securitygroup]
<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">Firewall driver for realizing neutron security group function.</span>
firewall_driver = neutron.agent.linux.iptables_firewall.OVSHybridIptablesFirewallDriver
[ovs]
tenant_network_type = gre
tunnel_id_ranges = 1:1000
enable_tunneling = True
integration_bridge = br-int
tunnel_bridge = br-tun
local_ip = 172.16.0.254
</pre>

</div>
</div>

</div>

<div id="outline-container-10-4" class="outline-3">
<h3 id="sec-10-4"><span class="section-number-3">10.4</span> 重启服务</h3>
<div class="outline-text-3" id="text-10-4">




<pre class="src src-sh"><span style="color: #859900;">cd</span> /etc/init.d/; <span style="color: #859900;">for</span> i<span style="color: #859900;"> in</span> $( ls neutron-* ); <span style="color: #859900;">do</span> sudo service $<span style="color: #268bd2;">i</span> restart; <span style="color: #859900;">done</span>
<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">&#26597;&#30475;&#26381;&#21153;&#29366;&#24577;</span>
neutron agent-list
+--------------------------------------+--------------------+--------+-------+----------------+
| id                                   | agent_type         | host   | alive | admin_state_up |
+--------------------------------------+--------------------+--------+-------+----------------+
| 6cc3719f-7c43-41c7-bc19-9839a362c321 | Open vSwitch agent | ubuntu | :-)   | True           |
| d96922b7-64a3-44f7-831f-1e9ea2033a33 | L3 agent           | ubuntu | :-)   | True           |
| ea701f27-1821-4134-9e6f-02acc8678e85 | DHCP agent         | ubuntu | :-)   | True           |
+--------------------------------------+--------------------+--------+-------+----------------+
</pre>

</div>
</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Orchestration Server(Heat)安装</h2>
<div class="outline-text-2" id="text-11">


</div>

<div id="outline-container-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> 安装</h3>
<div class="outline-text-3" id="text-11-1">




<pre class="src src-sh">apt-get install heat-api heat-api-cfn heat-engine heat-api-cloudwatch
</pre>

</div>

</div>

<div id="outline-container-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="section-number-3">11.2</span> 删除默认heat的sqlite db 文件</h3>
<div class="outline-text-3" id="text-11-2">




<pre class="src src-sh">rm -f /var/lib/heat/heat.sqlite
</pre>

</div>

</div>

<div id="outline-container-11-3" class="outline-3">
<h3 id="sec-11-3"><span class="section-number-3">11.3</span> 编辑配置文件</h3>
<div class="outline-text-3" id="text-11-3">

<p>/etc/heat/heat.conf
</p>


<pre class="src src-sh">verbose = True
<span style="color: #268bd2;">log_dir</span>=/var/log/heat
rabbit_host = 172.16.0.254
rabbit_password = guest

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">The SQLAlchemy connection string used to connect to the database</span>
sql_connection = mysql://heat:heat@172.16.0.254/heat

[keystone_authtoken]
auth_host = 172.16.0.254
auth_port = 35357
auth_protocol = http
auth_uri = http://172.16.0.254:5000/v2.0
admin_tenant_name = service
admin_user = heat
admin_password = heat
[ec2_authtoken]
auth_uri = http://172.16.0.254:5000/v2.0
keystone_ec2_uri = http://172.16.0.254:5000/v2.0/ec2tokens
</pre>

</div>

</div>

<div id="outline-container-11-4" class="outline-3">
<h3 id="sec-11-4"><span class="section-number-3">11.4</span> 同步数据</h3>
<div class="outline-text-3" id="text-11-4">




<pre class="src src-sh">heat-manage db_sync
</pre>

</div>

</div>

<div id="outline-container-11-5" class="outline-3">
<h3 id="sec-11-5"><span class="section-number-3">11.5</span> 创建用户和角色</h3>
<div class="outline-text-3" id="text-11-5">




<pre class="src src-sh">keystone user-create --name=heat --pass=heat --email=heat@example.com
keystone user-role-add --user=heat --tenant=service --role=admin
</pre>

</div>

</div>

<div id="outline-container-11-6" class="outline-3">
<h3 id="sec-11-6"><span class="section-number-3">11.6</span> 创建服务和endpoint</h3>
<div class="outline-text-3" id="text-11-6">




<pre class="src src-sh"><span style="color: #268bd2;">heat_id</span>=$(<span style="color: #fa8072;">keystone</span> service-create --name=heat --type=orchestration <span style="color: #2aa198;">\</span>
--description=<span style="color: #2aa198;">"Heat Orchestration API"</span> | awk <span style="color: #2aa198;">'/ id / { print $4 }'</span>)
keystone endpoint-create <span style="color: #2aa198;">\</span>
--service-id=$<span style="color: #268bd2;">heat_id</span> <span style="color: #2aa198;">\</span>
--publicurl=http://172.16.0.254:8004/v1/%<span style="color: #2aa198;">\(</span>tenant_id<span style="color: #2aa198;">\)</span>s <span style="color: #2aa198;">\</span>
--internalurl=http://172.16.0.254:8004/v1/%<span style="color: #2aa198;">\(</span>tenant_id<span style="color: #2aa198;">\)</span>s <span style="color: #2aa198;">\</span>
--adminurl=http://172.16.0.254:8004/v1/%<span style="color: #2aa198;">\(</span>tenant_id<span style="color: #2aa198;">\)</span>s

<span style="color: #268bd2;">heat_cfn_id</span>=$(<span style="color: #fa8072;">keystone</span> service-create --name=heat-cfn --type=cloudformation <span style="color: #2aa198;">\</span>
--description=<span style="color: #2aa198;">"Heat CloudFormation API"</span> | awk <span style="color: #2aa198;">'/ id / { print $4 }'</span>)
keystone endpoint-create <span style="color: #2aa198;">\</span>
--service-id=$<span style="color: #268bd2;">heat_cfn_id</span> <span style="color: #2aa198;">\</span>
--publicurl=http://172.16.0.254:8000/v1 <span style="color: #2aa198;">\</span>
--internalurl=http://172.16.0.254:8000/v1 <span style="color: #2aa198;">\</span>
--adminurl=http://172.16.0.254:8000/v1
</pre>

</div>

</div>

<div id="outline-container-11-7" class="outline-3">
<h3 id="sec-11-7"><span class="section-number-3">11.7</span> 重启服务</h3>
<div class="outline-text-3" id="text-11-7">




<pre class="src src-sh"><span style="color: #859900;">cd</span> /etc/init.d/; <span style="color: #859900;">for</span> i<span style="color: #859900;"> in</span> $( ls heat-* ); <span style="color: #859900;">do</span> sudo service $<span style="color: #268bd2;">i</span> restart; <span style="color: #859900;">done</span>
</pre>

</div>

</div>

<div id="outline-container-11-8" class="outline-3">
<h3 id="sec-11-8"><span class="section-number-3">11.8</span> 创建和管理stacks</h3>
<div class="outline-text-3" id="text-11-8">




<pre class="src src-sh">wget https://raw.github.com/openstack/heat-templates/master/cfn/F17/WordPress_Composed_Instances.template
glance image-create --name F17-x86_64-cfntools --disk-format qcow2 --container-format bare --is-public True --copy-from http://fedorapeople.org/groups/heat/prebuilt-jeos-images/F17-x86_64-cfntools.qcow2
nova keypair-add heat_key &gt; heat_key.priv
chmod 600 heat_key.priv
heat stack-create wordpress --template-file=WordPress_Composed_Instances.template --parameters=<span style="color: #2aa198;">"DBUsername=wp;DBPassword=wp;KeyName=userkey;LinuxDistribution=F17"</span>
heat stack-list
</pre>

<p>
PS:对heat还没有研究，创建stack是网上找的
</p></div>
</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Metering/Monitoring Server（Ceilometer）安装</h2>
<div class="outline-text-2" id="text-12">


</div>

<div id="outline-container-12-1" class="outline-3">
<h3 id="sec-12-1"><span class="section-number-3">12.1</span> 安装</h3>
<div class="outline-text-3" id="text-12-1">

<p>安装服务
</p>


<pre class="src src-sh">apt-get install ceilometer-api ceilometer-collector ceilometer-agent-central python-ceilometerclient ceilometer-agent-compute
</pre>

<p>
安装MongoDB Orchestration 服务使用数据库来存储信息，此示例使用MongoDB数据库
</p>


<pre class="src src-sh">apt-get install mongodb
</pre>

</div>

</div>

<div id="outline-container-12-2" class="outline-3">
<h3 id="sec-12-2"><span class="section-number-3">12.2</span> 创建数据库</h3>
<div class="outline-text-3" id="text-12-2">

<p>运行mongo命令如果报错couldn't connect to server 127.0.0.1:27017 at src/mongo/shell/mongo.js:145
</p>


<pre class="src src-sh">mongod --repair
service mongodb restart
</pre>


<pre class="src src-sh">mongo
&gt; use ceilometer
&gt; db.addUser( { user: <span style="color: #2aa198;">"ceilometer"</span>,
<span style="color: #859900;">pwd</span>: <span style="color: #2aa198;">"ceilometer"</span>,
roles: [ <span style="color: #2aa198;">"readWrite"</span>, <span style="color: #2aa198;">"dbAdmin"</span> ]
} )
</pre>

<p>
编辑/etc/mongodb.conf
</p>


<pre class="src src-sh"><span style="color: #268bd2;">bind_ip</span>=0.0.0.0
</pre>

<p>
重启数据库
</p>


<pre class="src src-sh">service mongodb restart
</pre>

</div>

</div>
