www/Openstack/openstack-havana-all-in-one-deploy.org
** 修改配置文件
修改/etc/ceilometer/ceilometer.conf
#+BEGIN_SRC sh
[DEFAULT]
http_control_exchanges=nova
http_control_exchanges=glance
http_control_exchanges=neutron
http_control_exchanges=cinder
auth_strategy=keystone
nova_control_exchange=nova
glance_control_exchange=glance
neutron_control_exchange=neutron
lock_path= /var/lock/ceilometer
state_path = /var/lib/ceilometer
debug=True
verbose= True
log_file= ceilometer.log
log_dir= /var/log/ceilometer
notification_driver=ceilometer.openstack.common.notifier.rabbit_notifier
default_notification_level=INFO
notification_topics=notifications
policy_file=policy.json
rpc_backend=ceilometer.openstack.common.rpc.impl_kombu
control_exchange=ceilometer
rabbit_host=172.16.0.254 
rabbit_port=5672
rabbit_userid=guest
rabbit_password=guest
database_connection= mongodb://ceilometer:ceilometer@172.16.0.254:27017/ceilometer
cinder_control_exchange=cinder
[publisher_rpc]
metering_secret=cdccc11cf024bd7de58e
[ssl]
[database]
[alarm]
[rpc_notifier2]
[api]
[service_credentials]
os_username=ceilometer
os_password=ceilometer
os_tenant_name=service
os_auth_url=http://172.16.0.254:5000/v2.0
[dispatcher_file]
[keystone_authtoken]
auth_host = 172.16.0.254
auth_port = 35357
auth_protocol = http
#这里写service,horizon无法加载ceilometer的信息
admin_tenant_name = admin
admin_user = admin
admin_password = password
auth_url = http://172.16.0.254:5000
[collector]
[matchmaker_ring]
[matchmaker_redis]
#+END_SRC
** 创建用户，角色，服务和endpoint
#+BEGIN_SRC sh
keystone user-create --name=ceilometer --pass=CEILOMETER_PASS --email=ceilometer@example.com
keystone user-role-add --user=ceilometer --tenant=service --role=admin

ceilometer_id=$(keystone service-create --name=ceilometer --type=metering \
--description="Ceilometer Metering Service" | awk '/ id / { print $4 }')
keystone endpoint-create \
--service-id=$ceilometer_id \
--publicurl=http://172.16.0.254:8777/ \
--internalurl=http://172.16.0.254:8777/ \
--adminurl=http://172.16.254:8777/
#+END_SRC
** 重启服务
#+BEGIN_SRC sh
cd /etc/init.d/; for i in $( ls ceilometer-* ); do sudo service $i restart; done
#+END_SRC
* 安装horizon
#+BEGIN_SRC sh
apt-get install memcached libapache2-mod-wsgi openstack-dashboard
apt-get remove --purge openstack-dashboard-ubuntu-theme
#+END_SRC
编辑/etc/openstack_dashboard/local_settings.py设置
#+BEGIN_SRC sh
OPENSTACK_KEYSTONE_DEFAULT_ROLE = "admin"
'enable_firewall' = True
TIME_ZONE = "Asia/Shanghai"
#+END_SRC
重启apache2
#+BEGIN_SRC sh
/etc/init.d/apache2 restart
#+END_SRC
浏览器访问192.168.60.108/horizon.
* 参考资料
** heat
http://openstack.redhat.com/Deploy_an_application_with_Heat \\
https://answers.launchpad.net/heat/+question/238879 \\
http://digitalsanctum.com/2013/05/01/how-to-install-openstack-heat/ \\
http://docs.openstack.org/developer/heat/getting_started/on_devstack.html \\
* 安装及使用问题
1. neutron-server无法启动，log报错AttributeError: 'NoneType' object has no attribute 'startswith' \\
   原因是CONF.api_paste_config无法找到，neutron.conf中api-paste.ini路径写错.
2. mysql报错Host 'hostname' is blocked because of many connection errors. \\
   Unblock with 'mysqladmin flush-hosts',运行 mysqladmin -uroot -p flush-hosts解决.是因为忘了建neutron数据库便启动neutron服务，造成连接问题。参考[[http://blog.itechol.com/space-33-do-blog-id-5670.html][mysql 连接出错 'mysqladmin flush-hosts']]
3. ceilometer信息界面一直显示加载中,参考https://bugs.launchpad.net/ceilometer/+bug/1232437 3楼的方法，改ceilometer.conf
   #+BEGIN_SRC sh
   admin_tenant_name = admin
   admin_user = admin
   admin_password = password
   #+END_SRC
4. 启用了namespace，建立虚拟机没有qvo,qvb等设备，虚拟机直接连在br-int上，nova.conf缺少libvirt_vif_driver=nova.virt.libvirt.vif.LibvirtHybridOVSBridgeDriver
5. l3-agent.log Failed unplugging interface 'qr-3fbe5f9e-a3',Failed unplugging interface 'qg-43105246-13' router忘了配接口
6. 删除了所有的router和network，ip netns仍旧能看到命名空间,运行neutron-netns-cleanup命令即可.
