public_html/Openstack/openstack-havana-all-in-one-deploy.html

<div id="outline-container-12-3" class="outline-3">
<h3 id="sec-12-3"><span class="section-number-3">12.3</span> 修改配置文件</h3>
<div class="outline-text-3" id="text-12-3">

<p>修改/etc/ceilometer/ceilometer.conf
</p>


<pre class="src src-sh">[DEFAULT]
<span style="color: #268bd2;">http_control_exchanges</span>=nova
<span style="color: #268bd2;">http_control_exchanges</span>=glance
<span style="color: #268bd2;">http_control_exchanges</span>=neutron
<span style="color: #268bd2;">http_control_exchanges</span>=cinder
<span style="color: #268bd2;">auth_strategy</span>=keystone
<span style="color: #268bd2;">nova_control_exchange</span>=nova
<span style="color: #268bd2;">glance_control_exchange</span>=glance
<span style="color: #268bd2;">neutron_control_exchange</span>=neutron
<span style="color: #268bd2;">lock_path</span>= /var/lock/ceilometer
state_path = /var/lib/ceilometer
<span style="color: #268bd2;">debug</span>=True
<span style="color: #268bd2;">verbose</span>= True
<span style="color: #268bd2;">log_file</span>= ceilometer.log
<span style="color: #268bd2;">log_dir</span>= /var/log/ceilometer
<span style="color: #268bd2;">notification_driver</span>=ceilometer.openstack.common.notifier.rabbit_notifier
<span style="color: #268bd2;">default_notification_level</span>=INFO
<span style="color: #268bd2;">notification_topics</span>=notifications
<span style="color: #268bd2;">policy_file</span>=policy.json
<span style="color: #268bd2;">rpc_backend</span>=ceilometer.openstack.common.rpc.impl_kombu
<span style="color: #268bd2;">control_exchange</span>=ceilometer
<span style="color: #268bd2;">rabbit_host</span>=172.16.0.254<span style="background-color: #ffd700;"> </span>
<span style="color: #268bd2;">rabbit_port</span>=5672
<span style="color: #268bd2;">rabbit_userid</span>=guest
<span style="color: #268bd2;">rabbit_password</span>=guest
<span style="color: #268bd2;">database_connection</span>= mongodb://ceilometer:ceilometer@172.16.0.254:27017/ceilometer
<span style="color: #268bd2;">cinder_control_exchange</span>=cinder
[publisher_rpc]
<span style="color: #268bd2;">metering_secret</span>=cdccc11cf024bd7de58e
[ssl]
[database]
[alarm]
[rpc_notifier2]
[api]
[service_credentials]
<span style="color: #268bd2;">os_username</span>=ceilometer
<span style="color: #268bd2;">os_password</span>=ceilometer
<span style="color: #268bd2;">os_tenant_name</span>=service
<span style="color: #268bd2;">os_auth_url</span>=http://172.16.0.254:5000/v2.0
[dispatcher_file]
[keystone_authtoken]
auth_host = 172.16.0.254
auth_port = 35357
auth_protocol = http
<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">&#36825;&#37324;&#20889;service,horizon&#26080;&#27861;&#21152;&#36733;ceilometer&#30340;&#20449;&#24687;</span>
admin_tenant_name = admin
admin_user = admin
admin_password = password
auth_url = http://172.16.0.254:5000
[collector]
[matchmaker_ring]
[matchmaker_redis]
</pre>

</div>

</div>

<div id="outline-container-12-4" class="outline-3">
<h3 id="sec-12-4"><span class="section-number-3">12.4</span> 创建用户，角色，服务和endpoint</h3>
<div class="outline-text-3" id="text-12-4">




<pre class="src src-sh">keystone user-create --name=ceilometer --pass=CEILOMETER_PASS --email=ceilometer@example.com
keystone user-role-add --user=ceilometer --tenant=service --role=admin

<span style="color: #268bd2;">ceilometer_id</span>=$(<span style="color: #fa8072;">keystone</span> service-create --name=ceilometer --type=metering <span style="color: #2aa198;">\</span>
--description=<span style="color: #2aa198;">"Ceilometer Metering Service"</span> | awk <span style="color: #2aa198;">'/ id / { print $4 }'</span>)
keystone endpoint-create <span style="color: #2aa198;">\</span>
--service-id=$<span style="color: #268bd2;">ceilometer_id</span> <span style="color: #2aa198;">\</span>
--publicurl=http://172.16.0.254:8777/ <span style="color: #2aa198;">\</span>
--internalurl=http://172.16.0.254:8777/ <span style="color: #2aa198;">\</span>
--adminurl=http://172.16.254:8777/
</pre>

</div>

</div>

<div id="outline-container-12-5" class="outline-3">
<h3 id="sec-12-5"><span class="section-number-3">12.5</span> 重启服务</h3>
<div class="outline-text-3" id="text-12-5">




<pre class="src src-sh"><span style="color: #859900;">cd</span> /etc/init.d/; <span style="color: #859900;">for</span> i<span style="color: #859900;"> in</span> $( ls ceilometer-* ); <span style="color: #859900;">do</span> sudo service $<span style="color: #268bd2;">i</span> restart; <span style="color: #859900;">done</span>
</pre>

</div>
</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> 安装horizon</h2>
<div class="outline-text-2" id="text-13">




<pre class="src src-sh">apt-get install memcached libapache2-mod-wsgi openstack-dashboard
apt-get remove --purge openstack-dashboard-ubuntu-theme
</pre>

<p>
编辑/etc/openstack_dashboard/local_settings.py设置
</p>


<pre class="src src-sh">OPENSTACK_KEYSTONE_DEFAULT_ROLE = <span style="color: #2aa198;">"admin"</span>
<span style="color: #2aa198;">'enable_firewall'</span> = True
TIME_ZONE = <span style="color: #2aa198;">"Asia/Shanghai"</span>
</pre>

<p>
重启apache2
</p>


<pre class="src src-sh">/etc/init.d/apache2 restart
</pre>

<p>
浏览器访问192.168.60.108/horizon.
</p></div>

</div>

<div id="outline-container-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> 参考资料</h2>
<div class="outline-text-2" id="text-14">


</div>

<div id="outline-container-14-1" class="outline-3">
<h3 id="sec-14-1"><span class="section-number-3">14.1</span> heat</h3>
<div class="outline-text-3" id="text-14-1">

<p><a href="http://openstack.redhat.com/Deploy_an_application_with_Heat">http://openstack.redhat.com/Deploy_an_application_with_Heat</a> <br/>
<a href="https://answers.launchpad.net/heat/+question/238879">https://answers.launchpad.net/heat/+question/238879</a> <br/>
<a href="http://digitalsanctum.com/2013/05/01/how-to-install-openstack-heat/">http://digitalsanctum.com/2013/05/01/how-to-install-openstack-heat/</a> <br/>
<a href="http://docs.openstack.org/developer/heat/getting_started/on_devstack.html">http://docs.openstack.org/developer/heat/getting_started/on_devstack.html</a> <br/>
</p></div>
</div>

</div>

<div id="outline-container-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> 安装及使用问题</h2>
<div class="outline-text-2" id="text-15">

<ol>
<li>neutron-server无法启动，log报错AttributeError: 'NoneType' object has no attribute 'startswith' <br/>
   原因是CONF.api_paste_config无法找到，neutron.conf中api-paste.ini路径写错.
</li>
<li>mysql报错Host 'hostname' is blocked because of many connection errors. <br/>
   Unblock with 'mysqladmin flush-hosts',运行 mysqladmin -uroot -p flush-hosts解决.是因为忘了建neutron数据库便启动neutron服务，造成连接问题。参考<a href="http://blog.itechol.com/space-33-do-blog-id-5670.html">mysql 连接出错 'mysqladmin flush-hosts'</a>
</li>
<li>ceilometer信息界面一直显示加载中,参考<a href="https://bugs.launchpad.net/ceilometer/+bug/1232437">https://bugs.launchpad.net/ceilometer/+bug/1232437</a> 3楼的方法，改ceilometer.conf



<pre class="src src-sh">admin_tenant_name = admin
admin_user = admin
admin_password = password
</pre>

</li>
<li>启用了namespace，建立虚拟机没有qvo,qvb等设备，虚拟机直接连在br-int上，nova.conf缺少libvirt_vif_driver=nova.virt.libvirt.vif.LibvirtHybridOVSBridgeDriver
</li>
<li>l3-agent.log Failed unplugging interface 'qr-3fbe5f9e-a3',Failed unplugging interface 'qg-43105246-13' router忘了配接口
</li>
<li>删除了所有的router和network，ip netns仍旧能看到命名空间,运行neutron-netns-cleanup命令即可.
</li>
</ol>

</div>
</div>
</div>

<div id="postamble">
    <p class="postamble">Last Updated 2014-01-07 10:38.</p> 
</div>
</body>
</html>
